; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v2 - type_3 ?v6 - type_2)
 	      (pred_1 ?v5 - object ?v6 - type_2)
	      (pred_4 ?v2 - type_3 ?v7 - type_1)
	      (pred_3 ?v2 - type_3 ?v5 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v2 - type_3 ?v8 ?v4 - type_2)
       :precondition (and  (pred_2 ?v2 ?v8))
       :effect (and  (pred_2 ?v2 ?v4)
		     (not (pred_2 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_3 ?v1 - object ?v3 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v3) (pred_2 ?v2 ?v3) (pred_4 ?v2 ?v7))
       :effect (and (pred_3 ?v2 ?v1 ?v7)
		    (not (pred_1 ?v1 ?v3)) 
		    (not (pred_4 ?v2 ?v7))))

   (:action op_1
       :parameters (?v2 - type_3 ?v1 - object ?v3 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v1 ?v7) (pred_2 ?v2 ?v3))
       :effect (and (pred_1 ?v1 ?v3)
		    (pred_4 ?v2 ?v7)
		    (not (pred_3 ?v2 ?v1 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_3
obj_02 obj_06 - type_1
obj_04 obj_07 obj_03 obj_01 - type_2
obj_10 obj_09 obj_05 - object)
(:init
(pred_2 obj_08 obj_07)
(pred_4 obj_08 obj_02)
(pred_4 obj_08 obj_06)
(pred_1 obj_10 obj_04)
(pred_1 obj_09 obj_07)
(pred_1 obj_05 obj_07)
)
(:goal
(and
(pred_1 obj_10 obj_07)
(pred_1 obj_09 obj_01)
(pred_1 obj_05 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_08 ?b obj_06))))
)
)

; plan
1. (op_3 obj_08 obj_09 obj_07 obj_02)
   deleted: (pred_1 obj_09 obj_07) (pred_4 obj_08 obj_02)
   added: (pred_3 obj_08 obj_09 obj_02)
   goals met: 0 of 3
2. (op_2 obj_08 obj_07 obj_01)
   deleted: (pred_2 obj_08 obj_07)
   added: (pred_2 obj_08 obj_01)
   goals met: 0 of 3
3. (op_1 obj_08 obj_09 obj_01 obj_02)
   deleted: (pred_3 obj_08 obj_09 obj_02)
   added: (pred_1 obj_09 obj_01) (pred_4 obj_08 obj_02)
   goals met: 1 of 3
4. (op_2 obj_08 obj_01 obj_04)
   deleted: (pred_2 obj_08 obj_01)
   added: (pred_2 obj_08 obj_04)
   goals met: 1 of 3
5. (op_3 obj_08 obj_10 obj_04 obj_02)
   deleted: (pred_1 obj_10 obj_04) (pred_4 obj_08 obj_02)
   added: (pred_3 obj_08 obj_10 obj_02)
   goals met: 1 of 3
6. (op_2 obj_08 obj_04 obj_07)
   deleted: (pred_2 obj_08 obj_04)
   added: (pred_2 obj_08 obj_07)
   goals met: 1 of 3
7. (op_1 obj_08 obj_10 obj_07 obj_02)
   deleted: (pred_3 obj_08 obj_10 obj_02)
   added: (pred_1 obj_10 obj_07) (pred_4 obj_08 obj_02)
   goals met: 2 of 3
8. (op_3 obj_08 obj_05 obj_07 obj_02)
   deleted: (pred_1 obj_05 obj_07) (pred_4 obj_08 obj_02)
   added: (pred_3 obj_08 obj_05 obj_02)
   goals met: 2 of 3
9. (op_2 obj_08 obj_07 obj_04)
   deleted: (pred_2 obj_08 obj_07)
   added: (pred_2 obj_08 obj_04)
   goals met: 2 of 3
10. (op_1 obj_08 obj_05 obj_04 obj_02)
   deleted: (pred_3 obj_08 obj_05 obj_02)
   added: (pred_1 obj_05 obj_04) (pred_4 obj_08 obj_02)
   goals met: 3 of 3
